//=============================================================================
//		３Ｄゲームプログラム
//		Ｃ３ＤＡｃｔ１１１                             ver 3.2        2023.1.31
//		武器・全体の処理
//															Weapon.cpp
//=============================================================================
#include  "Weapon.h"

//=============================================================================================================================
//
// 武器メインプロシージャのコンストラクタ
//
//   なお、プロシージャのdeleteはCBaseProcのデストラクタで行うため不要
//
// ----------------------------------------------------------------------------------------------------------------------------
CWeaponProc::CWeaponProc(CGameMain* pGMain) : CBaseProc(pGMain)
{

	m_pWeaponLaserProc = new CWeaponLaserProc(pGMain);		// 武器・レーザープロシージャ
	m_pProcArray.push_back(m_pWeaponLaserProc);				// プロシージャをプロシージャ配列に登録する

	m_pWeaponHoldProc = new CWeaponHoldProc(pGMain);		// 武器・手に持つアイテムのプロシージャ
	m_pProcArray.push_back(m_pWeaponHoldProc);				// プロシージャをプロシージャ配列に登録する

}
